Repository: wijnandb/CodeCult-Scratch
Catalog: modules/i18n/resources/locale/*/LC_MESSAGES/messages.po
Languages: am

source: Unit %(index)s - %(title)s
am: ምዕራፍ %(index)s - %(title)s

source: Unit %s
am: ክፍል %s

source: Yes, the answer is correct.
am: አዎ፣ መልሱ ትክክል ነው።

source: No, the answer is incorrect.
am: አይ፣ መልሱ ትክክል አይደለም።

source: The answer is partially correct.
am: መልሱ በከፊል ልክ ነው።

source: Your score is:
am: ውጤትዎ፦

source: JavaScript should be enabled to grade this question.
am: ለዚህ ጥያቄ ደረጃ ለመስጠት ጃቫስክሪፕት መንቃት አለበት።

source: Completed
am: ተጠናቅቋል

source: Not yet started
am: ገና አልተጀመረም

source: 1 point
am: 1 ነጥብ

source: %(points)s points
am: %(points)s ነጥቦች

source: Check Answer
am: መልስ ፈትሽ

source: Hint
am: ፍንጭ

source: Certificate of Completion
am: የትምህርት ማጠናቀቂያ ምስክር ወረቀት

source: Presented to
am: ተሰጥቷል ለ

source: for successfully completing the
am: የሚከተለውን በተሳካ ሁኔታ በማጠናቀቃቸው

source: %(course)s course
am: የ%(course)s ኮርስ

source: Certificate
am: ምስክር ወረቀት

source: Click for certificate
am: የምስክር ወረቀት ለማግኘት ጠቅ ያድርጉ

source: Download PDF
am: ተሰቅ አውርድ

source: You have not yet met the course requirements for a certificate of completion.
am: የትምህርት ማጠናቀቂያ ምስክር ወረቀት ለማግኘት የሚያስፈልገውን የኮርስ መስፈርት ገና አላሟሉም።

source: Explore Courses
am: ኮርሶችን ያስሱ

source: My Courses
am: የእኔ ኮርሶች

source: Profile
am: መገለጫ

source: View score
am: ውጤት ይመልከቱ

source: Go to course
am: ወደ ኮርስ ይሂዱ

source: Register
am: ይመዝገቡ

source: You are not currently enrolled in any courses.
am: በአሁኑ ጊዜ ለምንም ኮርሶች አልተመዘገቡም።

source: View course list.
am: የኮርስ ዝርዝር ይመልከቱ።

source: Student Profile for
am: የተማሪ መገለጫ ለ

source: Name
am: ስም

source: Email
am: ኢሜይል

source: Enrolled Courses
am: የተመዘገቡባቸው ኮርሶች

source: Progress
am: ሂደት

source: Withdraw
am: ማቋረጥ

source: New Name
am: አዲስ ስም

source: Change Name
am: ስም ቀይር

source: You cannot re-register for this course at the current time, because deletion of your previous data is still in progress. Please try again in in a few hours.
am: ከዚህ ቀደም የነበረው የእርስዎ ውሂብ ስረዛ አሁንም በሂደት ላይ ስለሆነ ለዚህ ትምህርት እንደገና በዚህ ጊዜ ላይ መመዝገብ አይችሉም። እባክዎ በጥቂት ሰዓቶች ውስጥ እንደገና ይሞክሩ።

source: Delete My Data
am: የእኔን ውሂብ ሰርዝ

source: Delete all associated data
am: ሁሉንም የተጎዳኘ ውሂብ ሰርዝ

source: Once you delete your data, there is no way to recover it.
am: አንዴ ውሂብዎን ከሰረዙ በኋላ መልሶ ማግኘት የሚችሉበት ምንም መንገድ የለም።

source: Deleting your content in this course will not delete your content from other courses. You must delete your content for each course separately.
am: በዚህ ኮርስ ላይ የእርስዎን ይዘት መሰረዝ ይዘትዎን ከሌላ ኮርሶች ላይ አይሰርዝም። ለእያንዳንዱ ኮርስ የእርስዎን ይዘት መሰረዝ አለብዎት።

source: This will also not delete your content in other products and services. For example, if you made a post in Google Groups or shared a Google Drive document, you may wish to delete those posts or update your sharing settings in those products.
am: ይህ እንዲሁም የእርስዎን ይዘት ከሌሎች ምርቶች እና አገልግሎቶች ላይ አይሰርዝም። ለምሳሌ፣ በGoogle ቡድኖች ውስጥ ልጥፍ ከሰሩ ወይም የGoogle Drive ሰነድ ካጋሩ እነዚያን ልጥፎች መሰረዝ ወይም በእነዚያ ምርቶች ላይ የእርስዎን የማጋሪያ ቅንብሮች ማዘመን ሊፈልጉ ይችላሉ።

source: OK
am: እሺ

source: Cancel
am: ይቅር

source: Pick an account to continue.
am: ለመቀጠል መለያ ይምረጡ።

source: (SAMPLE) Please confirm your email change
am: (ናሙና) እባክዎ የእርስዎን የኢሜይል ለውጥ ያረጋግጡ

source: SAMPLE
am: ናሙና

source: An email change has been requested from
am: የኢሜይል ለውጥ ከሚከተለው ተጠይቋል፦

source: to
am: ለ

source: Please visit
am: እባክዎ ይጎብኙ

source: to confirm this change.
am: ይህን ለውጥ ለማረጋገጥ።

source: Diagnostic information:
am: የምርመራ መረጃ፦

source: (SAMPLE) Password reset confirmation
am: (ናሙና) የይለፍ ቃል ዳግም ማስጀመር ማረጋገጫ

source: A password change has been requested for
am: የይለፍ ቃል ለውጥ ለሚከተለው ተጠይቋል፦

source: Error: Empty email list
am: ስህተት፦ ባዶ የኢሜይል ዝርዝር

source: This exceeds your email cap. Number of remaining invitations: %s. No messages sent.
am: ይህ የኢሜይል ገደብዎን ያልፋል። የቀሪ ግብዣዎች ብዛት፦ %s። ምንም መልእክቶች አልተላኩም።

source: Error: Invalid email "%s"
am: ስህተት፦ ልክ ያልሆነ ኢሜይል «%s»

source: Error: You have already sent an invitation email to "%s"
am: ስህተት፦ አስቀድመው የግብዣ ኢሜይል ለ«%s» ልከዋል

source: Not all messages were sent (%s / %s):
am: ሁሉም መልዕክቶች አይደሉም የተላኩት (%s / %s)፦

source: OK, %s messages sent
am: እሺ፣ %s መልዕክቶች ተልከዋል

source: Invite Friends
am: ጓደኛዎችን ይጋብዙ

source: Click to send invitations to family and friends
am: ግብዣዎችን ለቤተሰብ እና ለጓደኛዎች ለመላክ ጠቅ ያድርጉ

source: Invitations not currently available
am: ግብዣዎች በአሁኑ ጊዜ አይገኙም

source: Subscribe/Unsubscribe
am: ለደንበኝነት ይመዝገቡ/አይመዝገቡ

source: You are currently unsubscribed from course-related emails.
am: በአሁኑ ጊዜ ከትምህርት አይነት ጋር ከተገናኙ ኢሜይሎች ደንበኝነት ወጥተዋል።

source: Click here to re-subscribe.
am: ለደንበኝነት ዳግም ለመመዝገብ እዚህ ጠቅ ያድርጉ።

source: You are currently receiving course-related emails.
am: በአሁኑ ጊዜ ከትምህርት አይነት ጋር የተገናኙ ኢሜይሎችን እየተቀበሉ ነው።

source: Click here to unsubscribe.
am: ከደንበኝነት ምዝገባ ለመውጣት እዚህ ጠቅ ያድርጉ።

source: Course Progress
am: የኮርስ ሂደት

source: Invite friends or family members to join the course
am: ጓደኛዎች እና የቤተሰብ አባላት ኮርሱን እንዲቀላቀሉ ይጋብዟቸው

source: Do you know other people who might want to join this course? Enter their email addresses below and click "Send". They will receive an email from you with the text shown below.
am: ይህን ኮርስ መቀላቀል ሊፈልጉ የሚችሉ ሌሎች ሰዎች ያውቃሉ? የኢሜይል አድራሻዎቻቸውን ከታች ያስገቡና «ላክ»ን ጠቅ ያድርጉ። ከታች የሚታየው ጽሑፍ የያዘ ከእርስዎ የመጣ ኢሜይል ይደርሳቸዋል።

source: Enter recipients' email addresses separated by commas. E.g., alice@gmail.com, ben@gmail.com
am: በኮማ የተለያዩ የተቀባዮች የኢሜይል አድራሻዎችን ያስገቡ። ለምሳሌ፦ abebe@gmail.com፣ bezawit@gmail.com

source: Send
am: ላክ

source: Sample Email
am: የናሙና ኢሜይል

source: Subject:
am: ርዕሰ ጉዳይ፦

source: Access denied.
am: መዳረሻ ተከልክሏል።

source: Response submitted.
am: ምላሽ ገቢ ተደርጓል።

source: Submit answers
am: መልሶችን አስረክብ

source: Thank you for your feedback.
am: ለግብረመልስዎ እናመሰግናለን።

source: Rate this lesson:
am: ለዚህ ትምህርት ደረጃ ይስጡ፦

source: Not at all useful
am: ምንም ጥቅም የለውም

source: Not very useful
am: በጣም ጠቃሚ አይደለም

source: Somewhat useful
am: የሆነ ጥቅም አለው

source: Very useful
am: በጣም ጠቃሚ ነው

source: Extremely useful
am: እጅግ በጣም ጠቃሚ ነው

source: Additional comments...
am: ተጨማሪ አስተያየቶች...

source: Submit
am: አስገባ

source: Lesson
am: ትምህርት

source: Announcement
am: ማስታወቂያ

source: Search
am: ፍለጋ

source: Results for "%(query)s"
am: ውጤቶች ስለ«%(query)s»

source: Search took %(num_seconds)s seconds.
am: ፍለጋ %(num_seconds)s ሰከንዶች ወስዷል።

source: Previous
am: ቀዳሚ

source: Page %(number)s of %(total)s
am: ገጽ %(number)s ከ%(total)s

source: Next
am: ቀጣይ

source: No results for "%(query)s"
am: ስለ«%(query)s» ምንም ውጤቶች የሉም

source: Search is currently unavailable.
am: ፍለጋ በአሁኑ ጊዜ አይገኝም።

source: Taught in this lesson:
am: በዚህ ትምህርት ውስጥ የሚማሩት፦

source: Depends on:
am: በሚከተለው ላይ ይመረኮዛል፦

source: This lesson doesn't have any prerequisites.
am: ይህ ትምህርት ምንም ቅድመ-ይሁንታዎች የሉትም።

source: Leads to:
am: ይመራል ወደ፦

source: This lesson isn't a prerequisite for any other skills.
am: ይህ ትምህርት ለሌላ ማናቸውም ክህሎቶች በቅድሚያ መታወቅ ያለበት መስፈርት አይደለም።

source: Lessons
am: ትምህርቶች

source: Not taught
am: አልተማሩም

source: Proficiency level
am: የብቃት ደረጃ

source: low
am: ዝቅተኛ

source: high
am: ከፍተኛ

source: Skills Progress
am: የክህሎቶች ግስጋሴ ሂደት

source: Achievements
am: ስኬቶች

source: Currently, no acquired skills.
am: አሁን ላይ፣ ምንም ክህሎቶችን አልተማሩም።

source: Recommended Next
am: የሚመከር ቀጣይ

source: Currently, you have no recommended skills.
am: አሁን ላይ ምንም የሚመከሩ ክህሎቶች የሉዎትም።

source: The following email address has been subscribed to receive emails for this course:
am: የሚከተለው የኢሜይል አድራሻ ለዚህ ኮርስ ኢሜይሎችን ለመቀበል ለደንበኝነት ተመዝግቧል፦

source: The following email address has been unsubscribed from emails for this course:
am: የሚከተለው የኢሜይል አድራሻ ለዚህ ኮርስ ኢሜይሎችን ላለመቀበል ከደንበኝነት ምዝገባ ወጥቷል፦

source: If you prefer to continue receiving notifications, please click below to resubscribe.
am: ማሳወቂያዎችን መቀበል መቀጠል የሚፈልጉ ከሆነ፣ ዳግም ለደንበኝነት ለመመዝገብ እባክዎ ከታች ጠቅ ያድርጉ።

source: Resubscribe
am: ዳግም ለደንበኝነት ተመዝገብ

source: You have already submitted; submit again to replace your previous entry.
am: አስቀድመው አስገብተዋል፤ የእርስዎን ቀዳሚውን ግቤት ለመተካት እንደገና ያስገቡ።

source: Maximum file size is 1MB.
am: ከፍተኛው የፋይል መጠን 1 ሜባ ነው።

source: Your file has been successfully uploaded.
am: የእርስዎ ፋይል በተሳካ ሁኔታ ተሰቅሏል።

source: An error occurred.
am: ስህተት አጋጥሟል።

source: Return to the previous page.
am: ወደ ቀዳሚው ገጽ ይመለሱ።

source: Go back and try again.
am: ይመለሱና እንደገና ይሞክሩ።

source: Announcements
am: ማስታወቂያዎች

source: Currently, there are no announcements.
am: አሁን ላይ ምንም ማሳወቂያዎች የሉም።

source: The due date for submitting this assignment has passed. It was due on %(submission_due_date)s.
am: ይህንን የቤት ስራ ማስረከቢያው ቀን አልፏል። ማስረከቢያው በ%(submission_due_date)s ነበር።

source: Due date for this assignment:
am: የዚህ ቤት ስራ ማስገቢያ ቀን፦

source: You may only submit this assignment once. After you submit it, the assignment will become read-only, and you will not be able to modify your answers. The answers you submit here will be reviewed by your peers.
am: ይህንን የቤት ስራ አንድ ጊዜ ብቻ ነው ሊያስገቡት የሚችሉት። ካስገቡት በኋላ የቤት ስራው ተነባቢ-ብቻ ነው የሚሆነው፣ እና መልሶችዎን ሊቀይሯቸው አይችሉም። እዚህ የሚያስገቡት መልሶች በአቻዎችዎ ይገመገማሉ።

source: Submitted assignment
am: የገባው የቤት ስራ

source: Reviews received
am: የመጡ ግምገማዎች

source: After you have completed the required number of peer reviews for this assignment, the reviews you have received will appear here.
am: አስፈላጊውን የዚህ ቤት ስራ የአቻ ግምገማዎችን ካጠናቀቁ በኋላ የተቀበሏቸውን ግምገማዎች እዚህ ይመጣሉ።

source: Go to the review dashboard
am: ወደ የግምገማ ዳሽቦርዱ ይሂዱ

source: You have not received any peer reviews yet.
am: ገና ምንም የአቻ ግምገማዎችን አልተቀበሉልም።

source: This assessment is not available.
am: ይህ ግምገማ አይገኝም።

source: Save Draft
am: ረቂቅ አስቀምጥ

source: Submit Review
am: ግምገማ አስገባ

source: Check Answers
am: መልሶች ፈትሽ

source: Submit Answers
am: መልሶችን አስገባ

source: Assessment
am: ፈተና

source: Skip and Show Answer
am: ዝለል እና መልስ አሳይ

source: Save Answers
am: መልሶች አስቀምጥ

source: Submit Assignment
am: የቤት ስራ አስገባ

source: Please click one of the buttons for your answer.
am: ለመልስዎ እባክዎ ከአዝራሮቹ አንዱን ጠቅ ያድርጉ።

source: All your answers are correct!
am: ሁሉም መልሶችዎ ልክ ናቸው!

source: Number of questions you answered correctly
am: በትክክል የመለስዋቸው ጥያቄዎች ብዛት

source: You received a score on this assessment of
am: በዚህ ፈተና ማለፊያ ነጥብ አግኝተዋል

source: Here are lessons you could review to improve your score
am: ውጤትዎን ለማሻሻል መከለስ ያሉቦት ትምህርቶች እነዚህ ናቸው

source: Congratulations! Press the \'Submit Answers\' button to submit your grade.
am: እንኳን ደስ አለዎት! ውጤትዎን ለማስገባት እባክዎ \Submit Answers\' የሚለውን አዝራር ይጫኑ።

source: Press the \'Submit Answers\' button below to save your scores. You can also edit your answers above before clicking \'Submit Answers\'.
am: ውጤቶችዎን ለማስቀመጥ ከታች ያለውን የ\'Submit Answers\' አዝራር ይጫኑት። እንዲሁም \'Submit Answers\'ን ጠቅ ከማድረግዎ በፊት መልሶችዎን ከላይ ማርትዕ ይችላሉ።

source: Are you sure you want to submit this assignment?
am: እርግጠኛ ነዎት ይህንን የቤት ስራ ማስረከብ ይፈልጋሉ?

source: Are you sure you want to submit this review?
am: እርግጠኛ ነዎት ይህንን ግምገማ ማስረከብ ይፈልጋሉ?

source: You cannot edit or delete it after you have done so.
am: አንድ ጊዜ ከአስረከቡ በኋላ አርትዕ ማድረግ ወይም መሰረዝ አይችሉም።

source: Not registered
am: አልተመዘገበም

source: Logout
am: ዘግተው ውጣ

source: Login
am: ግባ

source: Privacy & Terms
am: ግላዊነት እና ውሎች

source: Locale:
am: አካባቢ፦

source: Course
am: ኮርስ

source: Forum
am: የውይይት መድረክ

source: Registration
am: ምዝገባ

source: Thank you for registering for the course. Click the Announcements tab for important information.
am: ለኮርሱ ስለተመዘገቡ እናመሰግናለን። አስፈላጊ መረጃ ለማየት የማስታወቂያዎች ትሩን ጠቅ ያድርጉ።

source: Registrations for this course are not open.
am: የዚህ ኮስር ምዝገባዎች ክፍት አይደሉም።

source: Syllabus
am: ስርዓተ-ትምህርት

source: Your review has not been saved, because it was submitted on %(time_now)s. The deadline for submitting reviews was %(review_due_date)s.
am: ግምገማዎ %(time_now)s ላይ ስለሆነ የገባው አልተቀመጠም። የግምገማዎች ማስገቢያ ቀነ-ገደብ %(review_due_date)s ላይ ነበር።

source: Your assignment has not been saved, because it was submitted on %(time_now)s. The deadline for submitting assignments was %(submission_due_date)s.
am: የቤት ስራዎ %(time_now)s ላይ ስለሆነ የገባው አልተቀመጠም። የቤት ስራዎች ማስገቢያ ቀነ-ገደብ %(submission_due_date)s ላይ ነበር።

source: You must submit the assignment for this unit before you can request new assignments to review.
am: አዲስ የሚገመገሙ የቤት ስራዎችን ማስገባት ከመቻልዎ በፊት ይህን የቤት ስራ ለዚህ ክፍል ማስገባት አለብዎት።

source: The deadline for submitting reviews has already passed, so you cannot request a new assignment to review.
am: የግምገማዎች ማስገቢያ ቀነ-ገደብ አልፏል፣ ስለዚህ አዲስ የሚገመገም የቤት ስራ መጠየቅ አይችሉም።

source: You must complete all assigned reviews before you can request a new one.
am: አዲስ ግምገማ መጠየቅ ከመቻልዎ በፊት ሁሉንም የተመደቡ ግምገማዎችን ማጠናቀቅ አለብዎት።

source: You have already submitted this review. Your latest review was not saved.
am: ይህን ግምገማ አስቀድመው አስገብተውታል። የቅርብ ጊዜ ግምገማዎ አልተቀመጠም።

source: Grade Questions
am: የውጤት መለኪያ ጥያቄዎች

source: YouTube Video Player
am: YouTube ቪድዮ አጫዋች

source: Text Version
am: የጽሁፍ ስሪት

source: This lesson is not available.
am: ይህ ትምህርት አይገኝም።

source: Not yet submitted
am: ገና አልገባም

source: In progress
am: በሂደት ላይ

source: Review peer assignments
am: የአቻዎች የቤት ስራዎችን ይገምግሙ

source: Activity
am: እንቅስቃሴ

source: Answer:
am: መልስ፦

source: What is your name?
am: ስምዎ ማነው?

source: Enroll
am: ይመዝገቡ

source: Review
am: ግምገማ

source: Back to the review dashboard.
am: ወደ የግምገማ ዳሽቦርድ ተመለስ።

source: The due date for submitting this review has passed. It was due on %(review_due_date)s.
am: ይህንን ግምገማ ማስረከቢያው ቀን አልፏል። ማስረከቢያው በ%(review_due_date)s ነበር።

source: Due date for this review:
am: የዚህ ግምገማ ማስገቢያ ቀን፦

source: The scores and comments you submit here will be viewed by your peers. Once you submit your review, you may not edit it.
am: እዚህ የሚያስገቧቸው ውጤቶች እና አስተያየቶች በአቻዎችዎ ይታያሉ። አንዴ ግምገማዎን ካስገቡ በኋላ አርትዖት ሊያደርጉበት አይችሉም።

source: Reviewed assignment
am: የተገመገመ የቤት ስራ

source: Assignment to review
am: የሚገመገም የቤት ስራ

source: Submitted review
am: የገባ ግምገማ

source: Review form
am: የግምገማ ቅጽ

source: Your review has been saved.
am: ግምገማዎ ተቀምጧል።

source: Your review has been submitted successfully.
am: ግምገማዎ በተሳካ ሁኔታ ገብቷል።

source: Back to the review dashboard
am: ወደ የግምገማ ዳሽቦርድ ተመለስ

source: Review Dashboard
am: የግምገማ ዳሽቦርድ

source: Assignments for your review
am: በእርስዎ የሚገመገሙ የቤት ስራዎች

source: The due date for submitting reviews has passed.
am: ግምገማዎችን የማስረከቢያው ቀን አልፏል።

source: All reviews are due by %(review_due_date)s.
am: ሁሉም ግምገማዎች እስከ %(review_due_date)s ድረስ መግባት አለባቸው።

source: In order to earn credit for this assignment, you must complete at least 1 review by then.
am: ለዚህ የቤት ስራ ክሬዲት ለማግኘት እስከዚያ ድረስ ቢያንስ 1 ግምገማ ማጠናቀቅ አለብዎት።

source: In order to earn credit for this assignment, you must complete at least %(review_min_count)d reviews by then.
am: ለዚህ የቤት ስራ ክሬዲት ለማግኘት እስከዚያ ድረስ ቢያንስ %(review_min_count)d ግምገማዎችን ማጠናቀቅ አለብዎት።

source: Assignment %(index)s
am: የቤት ስራ %(index)s

source: Draft
am: ረቂቅ

source: Review a new assignment
am: አዲስ የቤት ስራ ገምግም

source: Back to assignment
am: ወደ የቤት/ክፍል ስራ ተመለስ

source: Sorry, there are no new submissions available for you to review at this time.
am: ይቅርታ፣ በዚህ ጊዜ እርስዎ የሚገመግሟቸው አዲስ ግቤቶች የሉም።

source: You have already submitted this assignment. Your latest attempt has not been saved.
am: ይህንን የቤት ስራ አስቀድመው አስገብተውታል። የመጨረሻው ሙከራዎ አልተቀመጠም።

source: Thank you for completing this assignment. Your work was successfully submitted.
am: ይህንን የቤት ስራ ስላጠናቀቁት እናመሰግናነልን። ስራዎ በተሳካ ሁኔታ ገብቷል።

source: Review your peers' assignments by clicking on the button below.
am: ከታች ያለውን አዝራር ላይ ጠቅ በማድረግ የአቻዎችዎን የቤት ስራዎች ይገምግሙ።

source: Back to Course page
am: ወደ ኮርስ ገፅ ተመለስ

source: Date enrolled
am: የተመዘገቡበት ቀን

source: Assessment scores
am: የፈተና ውጤቶች

source: View assignment
am: የቤት ስራ ይመልከቱ

source: Overall course score
am: አጠቃላይ የኮርስ ውጤት

source: Student Progress
am: የተማሪ ሂደት

source: To leave the course permanently, click on Unenroll
am: ኮርሱን በቋሚነት ለመተው ከምዝገባ ውጣ የሚለውን ጠቅ ያድርጉ

source: Unenroll
am: ከምዝገባ ውጣ

source: Manage course registration from your profile
am: የኮርስ ምዝገባ ከመገለጫዎ ሆነው ያቀናብሩ

source: Student profile not found ...
am: የተማሪ መገለጫ አልተገኘም ...

source: Thank you for taking the %(assessment_name)s. Your score for this assessment is %(score)s%%. If you wish, you may return to the assessment and take it again.
am: %(assessment_name)sን ስለወሰዱ እናመሰግናለን። በዚህ ፈተና ላይ ያመጡት ውጤት %(score)s%% ነው። ከፈለጉ ወደ ፈተናው ተመልሰው እንደገና ሊወስዱት ይችላሉ።

source: Return to Unit
am: ወደ አሃድ ተመለስ

source: Course Tracks
am: የኮርስ ትራኮች

source: Course Components
am: የኮርስ ክፍሎች

source: My Tracks
am: የእኔ ትራኮች

source: Set Tracks
am: ትራኮችን አዘጋጅ

source: You have been unenrolled from
am: ከሚከተለው ምዝገባ ወጥተዋል

source: Are you sure you want to unenroll from
am: ከሚከተለው ምዝገባ መውጣት እንደሚፈልጉ እርግጠኛ ነዎት፦

source: Yes
am: አዎ

source: No
am: አይ

source: Show Syllabus
am: ስርዓተ-ትምህርት አሳይ

source: Hide Syllabus
am: ስርዓተ-ትምህርት ደብቅ

source: This unit has no content.
am: ይህ አሃድ ምንም ይዘት የለውም።

source: Previous Page
am: ቀዳሚ ገፅ

source: Next Page
am: ቀጣይ ገፅ

source: End
am: መጨረሻ
